---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides)
source: html/9123ae1c-93e6-9b8f-f029-ad82f967d8e8.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.IsEqual Method

Check if the contents of two overrides are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	DirectContext3DHandleOverrides other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides`) - The overrides to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null